VPro/src/InformationRegisters/SettlementsBalances/SettlementsBalances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SettlementsBalances</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/AccumulationRegisters/AccountsReceivable/AccountsReceivable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsReceivable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.FixedAssetsTransfer</types>
      <types>DocumentRef.CustomerInvoice</types>
      <types>DocumentRef.AgentReport</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.AcceptanceCertificate</types>
      <types>DocumentRef.ProcessingReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.CustomerOrder</types>
      <types>DocumentRef.Netting</types>
      <types>DocumentRef.PaymentReceipt</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.CustomerOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VPro/src/AccumulationRegisters/AccountsPayable/AccountsPayable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsPayable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.CustomerInvoice</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.SubcontractorReport</types>
      <types>DocumentRef.ReportToPrincipal</types>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.Netting</types>
      <types>DocumentRef.AdditionalCosts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VPro/src/AccumulationRegisters/SettlementsWithOtherCounterparties/SettlementsWithOtherCounterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>SettlementsWithOtherCounterparties</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VPro/src/InformationRegisters/SettlementsBalances/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Процедура обновляет данные регистра для переданных контагентов по текущим остаткам взаиморасчетов.
//
// Parameters:
//  Counterparties	 - Array, ValueTable	 - контрагенты, для которых необходимо обновить данные регистра.
//		Если параметр не указан, обновляются остатки по всем контрагентам.
//
Procedure UpdateSettlementsBalances(Val Counterparties = Undefined) Export
	
	If TypeOf(Counterparties) = Type("Array") Then
		CounterpartyTable = New ValueTable;
		CounterpartyTable.Columns.Add("Counterparty", New TypeDescription("CatalogRef.Counterparties"));
		For Each Counterparty In Counterparties Do
			NewRow = CounterpartyTable.Add();
			NewRow.Counterparty = Counterparty;
		EndDo;
		Counterparties = CounterpartyTable;
	EndIf;
	
	Query = New Query;
	
	If Counterparties = Undefined Then
		
		Query.Text = 
			"SELECT
			|	NestedQuery.Counterparty,
			|	SUM(NestedQuery.AmountBalance) AS AmountBalance
			|INTO TTSettlements
			|FROM
			|	(SELECT
			|		AccountsReceivableBalances.Counterparty AS Counterparty,
			|		AccountsReceivableBalances.AmountBalance AS AmountBalance
			|	FROM
			|		AccumulationRegister.AccountsReceivable.Balance AS AccountsReceivableBalances
			|	
			|	UNION ALL
			|	
			|	SELECT
			|		AccountsPayableBalances.Counterparty,
			|		-AccountsPayableBalances.AmountBalance
			|	FROM
			|		AccumulationRegister.AccountsPayable.Balance AS AccountsPayableBalances
			|	
			|	UNION ALL
			|	
			|	SELECT
			|		SettlementsWithOtherCounterpartiesBalances.Counterparty,
			|		SettlementsWithOtherCounterpartiesBalances.AmountBalance
			|	FROM
			|		AccumulationRegister.SettlementsWithOtherCounterparties.Balance AS SettlementsWithOtherCounterpartiesBalances) AS NestedQuery
			|
			|GROUP BY
			|	NestedQuery.Counterparty
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT
			|	ISNULL(SettlementsBalances.Counterparty, TTSettlements.Counterparty) AS Counterparty,
			|	ISNULL(TTSettlements.AmountBalance, 0) AS AmountBalance
			|FROM
			|	InformationRegister.SettlementsBalances AS SettlementsBalances
			|		FULL JOIN TTSettlements AS TTSettlements
			|		ON SettlementsBalances.Counterparty = TTSettlements.Counterparty";
		
	Else
		
		Query.Text = 
			"SELECT
			|	Counterparties.Counterparty
			|INTO vtCounterparties
			|FROM
			|	&Counterparties AS Counterparties
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT
			|	NestedQuery.Counterparty,
			|	SUM(NestedQuery.AmountBalance) AS AmountBalance
			|INTO TTSettlements
			|FROM
			|	(SELECT
			|		AccountsReceivableBalances.Counterparty AS Counterparty,
			|		AccountsReceivableBalances.AmountBalance AS AmountBalance
			|	FROM
			|		AccumulationRegister.AccountsReceivable.Balance(, Counterparty IN (&Counterparties)) AS AccountsReceivableBalances
			|	
			|	UNION ALL
			|	
			|	SELECT
			|		AccountsPayableBalances.Counterparty,
			|		-AccountsPayableBalances.AmountBalance
			|	FROM
			|		AccumulationRegister.AccountsPayable.Balance(, Counterparty IN (&Counterparties)) AS AccountsPayableBalances
			|	
			|	UNION ALL
			|	
			|	SELECT
			|		SettlementsWithOtherCounterpartiesBalances.Counterparty,
			|		SettlementsWithOtherCounterpartiesBalances.AmountBalance
			|	FROM
			|		AccumulationRegister.SettlementsWithOtherCounterparties.Balance(, Counterparty IN (&Counterparties)) AS SettlementsWithOtherCounterpartiesBalances) AS NestedQuery
			|
			|GROUP BY
			|	NestedQuery.Counterparty
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT
			|	vtCounterparties.Counterparty AS Counterparty,
			|	ISNULL(TTSettlements.AmountBalance, 0) AS AmountBalance
			|FROM
			|	vtCounterparties AS vtCounterparties
			|		LEFT JOIN TTSettlements AS TTSettlements
			|		ON vtCounterparties.Counterparty = TTSettlements.Counterparty";
		
		Query.SetParameter("Counterparties", Counterparties);
	
	EndIf;
	
	RecordSet = InformationRegisters.SettlementsBalances.CreateRecordSet();
	SELECTION = Query.Execute().Select();
	
	While SELECTION.Next() Do
		
		RecordSet.Filter.Counterparty.Set(SELECTION.Counterparty);
		
		If SELECTION.AmountBalance = 0 Then
			RecordSet.Write(True);
			Continue;
		EndIf;
		
		RecordSet.Read();
		
		If RecordSet.Count() > 0 Then
			WriteSet = RecordSet[0];
		Else
			WriteSet = RecordSet.Add();
		EndIf;
		WriteSet.Counterparty = SELECTION.Counterparty;
		WriteSet.Amount = SELECTION.AmountBalance;
		
		RecordSet.Write(True);
		RecordSet.Clear();
		
	EndDo;
	
EndProcedure

#Region ForCallsFromOtherSubsystems

// СтандартныеПодсистемы.УправлениеДоступом

// See AccessManagementOverridable.OnFillListWithAccessRestriction.
Procedure OnFillAccessRestriction(Restriction) Export

	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	ValueAllowed(Counterparty)";

EndProcedure

// Конец СтандартныеПодсистемы.УправлениеДоступом

#EndRegion

#EndRegion

#EndIf
